{
  "video_info": {
    "frames_directory": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes",
    "transcript_file": "/Users/kcdacre8tor/veidotools/transcripts/1766661151-Stop_Vibe_Coding._Start_Architecting..en.srt",
    "total_frames": 203,
    "total_transcript_segments": 318
  },
  "timeline": [
    {
      "frame_number": 1,
      "timestamp": 0.0,
      "timestamp_formatted": "00:00:00",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0001.png",
      "transcript": "",
      "segment_count": 0
    },
    {
      "frame_number": 2,
      "timestamp": 2.0,
      "timestamp_formatted": "00:00:02",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0002.png",
      "transcript": "When people talk about AI coding tools, When people talk about AI coding tools, they usually talk about one thing,",
      "segment_count": 2
    },
    {
      "frame_number": 3,
      "timestamp": 4.0,
      "timestamp_formatted": "00:00:04",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0003.png",
      "transcript": "When people talk about AI coding tools, When people talk about AI coding tools, they usually talk about one thing, they usually talk about one thing, they usually talk about one thing, speed, rapid prototyping, vibe coding,",
      "segment_count": 4
    },
    {
      "frame_number": 4,
      "timestamp": 6.0,
      "timestamp_formatted": "00:00:06",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0004.png",
      "transcript": "When people talk about AI coding tools, they usually talk about one thing, they usually talk about one thing, they usually talk about one thing, speed, rapid prototyping, vibe coding,",
      "segment_count": 3
    },
    {
      "frame_number": 5,
      "timestamp": 8.0,
      "timestamp_formatted": "00:00:08",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0005.png",
      "transcript": "they usually talk about one thing, speed, rapid prototyping, vibe coding, speed, rapid prototyping, vibe coding, speed, rapid prototyping, vibe coding, spinning up things in a flash. And sure,",
      "segment_count": 3
    },
    {
      "frame_number": 6,
      "timestamp": 10.0,
      "timestamp_formatted": "00:00:10",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0006.png",
      "transcript": "they usually talk about one thing, speed, rapid prototyping, vibe coding, speed, rapid prototyping, vibe coding, speed, rapid prototyping, vibe coding, spinning up things in a flash. And sure, spinning up things in a flash. And sure, spinning up things in a flash. And sure, that's part of it, but it's not all of",
      "segment_count": 5
    },
    {
      "frame_number": 7,
      "timestamp": 12.0,
      "timestamp_formatted": "00:00:12",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0007.png",
      "transcript": "speed, rapid prototyping, vibe coding, spinning up things in a flash. And sure, spinning up things in a flash. And sure, spinning up things in a flash. And sure, that's part of it, but it's not all of that's part of it, but it's not all of that's part of it, but it's not all of it, and it's not the most important",
      "segment_count": 5
    },
    {
      "frame_number": 8,
      "timestamp": 14.0,
      "timestamp_formatted": "00:00:14",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0008.png",
      "transcript": "spinning up things in a flash. And sure, that's part of it, but it's not all of that's part of it, but it's not all of that's part of it, but it's not all of it, and it's not the most important it, and it's not the most important it, and it's not the most important part. An AI agent is just another tool",
      "segment_count": 5
    },
    {
      "frame_number": 9,
      "timestamp": 16.0,
      "timestamp_formatted": "00:00:16",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0009.png",
      "transcript": "that's part of it, but it's not all of it, and it's not the most important it, and it's not the most important it, and it's not the most important part. An AI agent is just another tool",
      "segment_count": 3
    },
    {
      "frame_number": 10,
      "timestamp": 18.0,
      "timestamp_formatted": "00:00:18",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0010.png",
      "transcript": "it, and it's not the most important part. An AI agent is just another tool part. An AI agent is just another tool part. An AI agent is just another tool in your tool belt, like a debugger or",
      "segment_count": 3
    },
    {
      "frame_number": 11,
      "timestamp": 20.0,
      "timestamp_formatted": "00:00:20",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0011.png",
      "transcript": "it, and it's not the most important part. An AI agent is just another tool part. An AI agent is just another tool part. An AI agent is just another tool in your tool belt, like a debugger or in your tool belt, like a debugger or in your tool belt, like a debugger or autocomplete. And like any professional",
      "segment_count": 5
    },
    {
      "frame_number": 12,
      "timestamp": 22.0,
      "timestamp_formatted": "00:00:22",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0012.png",
      "transcript": "part. An AI agent is just another tool in your tool belt, like a debugger or in your tool belt, like a debugger or in your tool belt, like a debugger or autocomplete. And like any professional autocomplete. And like any professional autocomplete. And like any professional tool, you need the skill to master it.",
      "segment_count": 5
    },
    {
      "frame_number": 13,
      "timestamp": 24.0,
      "timestamp_formatted": "00:00:24",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0013.png",
      "transcript": "in your tool belt, like a debugger or autocomplete. And like any professional autocomplete. And like any professional autocomplete. And like any professional tool, you need the skill to master it.",
      "segment_count": 3
    },
    {
      "frame_number": 14,
      "timestamp": 26.0,
      "timestamp_formatted": "00:00:26",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0014.png",
      "transcript": "autocomplete. And like any professional tool, you need the skill to master it. tool, you need the skill to master it. tool, you need the skill to master it. So, in this video, I'm going to show you",
      "segment_count": 3
    },
    {
      "frame_number": 15,
      "timestamp": 28.0,
      "timestamp_formatted": "00:00:28",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0015.png",
      "transcript": "autocomplete. And like any professional tool, you need the skill to master it. tool, you need the skill to master it. tool, you need the skill to master it. So, in this video, I'm going to show you So, in this video, I'm going to show you So, in this video, I'm going to show you how to use Dreamflow to go beyond simple",
      "segment_count": 5
    },
    {
      "frame_number": 16,
      "timestamp": 30.0,
      "timestamp_formatted": "00:00:30",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0016.png",
      "transcript": "tool, you need the skill to master it. So, in this video, I'm going to show you So, in this video, I'm going to show you So, in this video, I'm going to show you how to use Dreamflow to go beyond simple how to use Dreamflow to go beyond simple how to use Dreamflow to go beyond simple prototypes. We're going to prompt",
      "segment_count": 5
    },
    {
      "frame_number": 17,
      "timestamp": 32.0,
      "timestamp_formatted": "00:00:32",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0017.png",
      "transcript": "So, in this video, I'm going to show you how to use Dreamflow to go beyond simple how to use Dreamflow to go beyond simple how to use Dreamflow to go beyond simple prototypes. We're going to prompt prototypes. We're going to prompt prototypes. We're going to prompt Dreamflow to set up real production",
      "segment_count": 5
    },
    {
      "frame_number": 18,
      "timestamp": 34.0,
      "timestamp_formatted": "00:00:34",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0018.png",
      "transcript": "how to use Dreamflow to go beyond simple prototypes. We're going to prompt prototypes. We're going to prompt prototypes. We're going to prompt Dreamflow to set up real production Dreamflow to set up real production Dreamflow to set up real production architectural patterns. I'll show you",
      "segment_count": 5
    },
    {
      "frame_number": 19,
      "timestamp": 36.0,
      "timestamp_formatted": "00:00:36",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0019.png",
      "transcript": "prototypes. We're going to prompt Dreamflow to set up real production Dreamflow to set up real production Dreamflow to set up real production architectural patterns. I'll show you architectural patterns. I'll show you architectural patterns. I'll show you how to prompt like an architect so you",
      "segment_count": 5
    },
    {
      "frame_number": 20,
      "timestamp": 38.0,
      "timestamp_formatted": "00:00:38",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0020.png",
      "transcript": "Dreamflow to set up real production architectural patterns. I'll show you architectural patterns. I'll show you architectural patterns. I'll show you how to prompt like an architect so you how to prompt like an architect so you how to prompt like an architect so you can build code bases that will last.",
      "segment_count": 5
    },
    {
      "frame_number": 21,
      "timestamp": 40.0,
      "timestamp_formatted": "00:00:40",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0021.png",
      "transcript": "architectural patterns. I'll show you how to prompt like an architect so you how to prompt like an architect so you how to prompt like an architect so you can build code bases that will last.",
      "segment_count": 3
    },
    {
      "frame_number": 22,
      "timestamp": 42.0,
      "timestamp_formatted": "00:00:42",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0022.png",
      "transcript": "how to prompt like an architect so you can build code bases that will last. can build code bases that will last. can build code bases that will last. Okay, so let's jump into DreamFlow here",
      "segment_count": 3
    },
    {
      "frame_number": 23,
      "timestamp": 44.0,
      "timestamp_formatted": "00:00:44",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0023.png",
      "transcript": "how to prompt like an architect so you can build code bases that will last. can build code bases that will last. can build code bases that will last. Okay, so let's jump into DreamFlow here Okay, so let's jump into DreamFlow here Okay, so let's jump into DreamFlow here and we're going to create a new project",
      "segment_count": 5
    },
    {
      "frame_number": 24,
      "timestamp": 46.0,
      "timestamp_formatted": "00:00:46",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0024.png",
      "transcript": "can build code bases that will last. Okay, so let's jump into DreamFlow here Okay, so let's jump into DreamFlow here Okay, so let's jump into DreamFlow here and we're going to create a new project and we're going to create a new project and we're going to create a new project right here. And it's just going to be a",
      "segment_count": 5
    },
    {
      "frame_number": 25,
      "timestamp": 48.0,
      "timestamp_formatted": "00:00:48",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0025.png",
      "transcript": "Okay, so let's jump into DreamFlow here and we're going to create a new project and we're going to create a new project and we're going to create a new project right here. And it's just going to be a right here. And it's just going to be a right here. And it's just going to be a habit tracker. So, we're just going to",
      "segment_count": 5
    },
    {
      "frame_number": 26,
      "timestamp": 50.0,
      "timestamp_formatted": "00:00:50",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0026.png",
      "transcript": "and we're going to create a new project right here. And it's just going to be a right here. And it's just going to be a right here. And it's just going to be a habit tracker. So, we're just going to habit tracker. So, we're just going to habit tracker. So, we're just going to call it habity.",
      "segment_count": 5
    },
    {
      "frame_number": 27,
      "timestamp": 52.0,
      "timestamp_formatted": "00:00:52",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0027.png",
      "transcript": "right here. And it's just going to be a habit tracker. So, we're just going to habit tracker. So, we're just going to habit tracker. So, we're just going to call it habity. call it habity. call it habity. Create project. And when you create a",
      "segment_count": 5
    },
    {
      "frame_number": 28,
      "timestamp": 54.0,
      "timestamp_formatted": "00:00:54",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0028.png",
      "transcript": "habit tracker. So, we're just going to call it habity. call it habity. call it habity. Create project. And when you create a Create project. And when you create a Create project. And when you create a project, we're just running Flutter",
      "segment_count": 5
    },
    {
      "frame_number": 29,
      "timestamp": 56.0,
      "timestamp_formatted": "00:00:56",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0029.png",
      "transcript": "call it habity. Create project. And when you create a Create project. And when you create a Create project. And when you create a project, we're just running Flutter project, we're just running Flutter project, we're just running Flutter create under the hood to scaffold out a",
      "segment_count": 5
    },
    {
      "frame_number": 30,
      "timestamp": 58.0,
      "timestamp_formatted": "00:00:58",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0030.png",
      "transcript": "Create project. And when you create a project, we're just running Flutter project, we're just running Flutter project, we're just running Flutter create under the hood to scaffold out a create under the hood to scaffold out a create under the hood to scaffold out a basic app. Okay, so here's my scaffolded",
      "segment_count": 5
    },
    {
      "frame_number": 31,
      "timestamp": 60.0,
      "timestamp_formatted": "00:01:00",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0031.png",
      "transcript": "project, we're just running Flutter create under the hood to scaffold out a create under the hood to scaffold out a create under the hood to scaffold out a basic app. Okay, so here's my scaffolded basic app. Okay, so here's my scaffolded basic app. Okay, so here's my scaffolded out app. I've got my agent open over",
      "segment_count": 5
    },
    {
      "frame_number": 32,
      "timestamp": 62.0,
      "timestamp_formatted": "00:01:02",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0032.png",
      "transcript": "create under the hood to scaffold out a basic app. Okay, so here's my scaffolded basic app. Okay, so here's my scaffolded basic app. Okay, so here's my scaffolded out app. I've got my agent open over",
      "segment_count": 3
    },
    {
      "frame_number": 33,
      "timestamp": 64.0,
      "timestamp_formatted": "00:01:04",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0033.png",
      "transcript": "basic app. Okay, so here's my scaffolded basic app. Okay, so here's my scaffolded out app. I've got my agent open over out app. I've got my agent open over out app. I've got my agent open over here. Now, the main thing you want to do",
      "segment_count": 4
    },
    {
      "frame_number": 34,
      "timestamp": 66.0,
      "timestamp_formatted": "00:01:06",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0034.png",
      "transcript": "basic app. Okay, so here's my scaffolded out app. I've got my agent open over out app. I've got my agent open over out app. I've got my agent open over here. Now, the main thing you want to do here. Now, the main thing you want to do here. Now, the main thing you want to do when you're building with AI is you want",
      "segment_count": 5
    },
    {
      "frame_number": 35,
      "timestamp": 68.0,
      "timestamp_formatted": "00:01:08",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0035.png",
      "transcript": "out app. I've got my agent open over here. Now, the main thing you want to do here. Now, the main thing you want to do here. Now, the main thing you want to do when you're building with AI is you want when you're building with AI is you want when you're building with AI is you want to work in small iterable and testable",
      "segment_count": 5
    },
    {
      "frame_number": 36,
      "timestamp": 70.0,
      "timestamp_formatted": "00:01:10",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0036.png",
      "transcript": "here. Now, the main thing you want to do when you're building with AI is you want when you're building with AI is you want when you're building with AI is you want to work in small iterable and testable to work in small iterable and testable to work in small iterable and testable steps. So, I'm going to just start out",
      "segment_count": 5
    },
    {
      "frame_number": 37,
      "timestamp": 72.0,
      "timestamp_formatted": "00:01:12",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0037.png",
      "transcript": "when you're building with AI is you want to work in small iterable and testable to work in small iterable and testable to work in small iterable and testable steps. So, I'm going to just start out steps. So, I'm going to just start out steps. So, I'm going to just start out by creating some of the files and",
      "segment_count": 5
    },
    {
      "frame_number": 38,
      "timestamp": 74.0,
      "timestamp_formatted": "00:01:14",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0038.png",
      "transcript": "to work in small iterable and testable steps. So, I'm going to just start out steps. So, I'm going to just start out steps. So, I'm going to just start out by creating some of the files and by creating some of the files and by creating some of the files and folders. So I'm going to say I would",
      "segment_count": 5
    },
    {
      "frame_number": 39,
      "timestamp": 76.0,
      "timestamp_formatted": "00:01:16",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0039.png",
      "transcript": "steps. So, I'm going to just start out by creating some of the files and by creating some of the files and by creating some of the files and folders. So I'm going to say I would folders. So I'm going to say I would folders. So I'm going to say I would like to create a habit tracker app using",
      "segment_count": 5
    },
    {
      "frame_number": 40,
      "timestamp": 78.0,
      "timestamp_formatted": "00:01:18",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0040.png",
      "transcript": "by creating some of the files and folders. So I'm going to say I would folders. So I'm going to say I would folders. So I'm going to say I would like to create a habit tracker app using",
      "segment_count": 3
    },
    {
      "frame_number": 41,
      "timestamp": 80.0,
      "timestamp_formatted": "00:01:20",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0041.png",
      "transcript": "folders. So I'm going to say I would like to create a habit tracker app using",
      "segment_count": 1
    },
    {
      "frame_number": 42,
      "timestamp": 82.0,
      "timestamp_formatted": "00:01:22",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0042.png",
      "transcript": "folders. So I'm going to say I would like to create a habit tracker app using like to create a habit tracker app using like to create a habit tracker app using layered architecture and provider for",
      "segment_count": 3
    },
    {
      "frame_number": 43,
      "timestamp": 84.0,
      "timestamp_formatted": "00:01:24",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0043.png",
      "transcript": "folders. So I'm going to say I would like to create a habit tracker app using like to create a habit tracker app using like to create a habit tracker app using layered architecture and provider for",
      "segment_count": 3
    },
    {
      "frame_number": 44,
      "timestamp": 86.0,
      "timestamp_formatted": "00:01:26",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0044.png",
      "transcript": "like to create a habit tracker app using layered architecture and provider for layered architecture and provider for layered architecture and provider for state management. So I want the agent to",
      "segment_count": 3
    },
    {
      "frame_number": 45,
      "timestamp": 88.0,
      "timestamp_formatted": "00:01:28",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0045.png",
      "transcript": "like to create a habit tracker app using layered architecture and provider for layered architecture and provider for layered architecture and provider for state management. So I want the agent to state management. So I want the agent to state management. So I want the agent to create the files and folders but don't",
      "segment_count": 5
    },
    {
      "frame_number": 46,
      "timestamp": 90.0,
      "timestamp_formatted": "00:01:30",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0046.png",
      "transcript": "layered architecture and provider for state management. So I want the agent to state management. So I want the agent to state management. So I want the agent to create the files and folders but don't",
      "segment_count": 3
    },
    {
      "frame_number": 47,
      "timestamp": 92.0,
      "timestamp_formatted": "00:01:32",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0047.png",
      "transcript": "state management. So I want the agent to create the files and folders but don't create the files and folders but don't create the files and folders but don't write any of the code yet. And then I've",
      "segment_count": 3
    },
    {
      "frame_number": 48,
      "timestamp": 94.0,
      "timestamp_formatted": "00:01:34",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0048.png",
      "transcript": "state management. So I want the agent to create the files and folders but don't create the files and folders but don't create the files and folders but don't write any of the code yet. And then I've write any of the code yet. And then I've write any of the code yet. And then I've got this architectural diagram that I'm",
      "segment_count": 5
    },
    {
      "frame_number": 49,
      "timestamp": 96.0,
      "timestamp_formatted": "00:01:36",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0049.png",
      "transcript": "create the files and folders but don't write any of the code yet. And then I've write any of the code yet. And then I've write any of the code yet. And then I've got this architectural diagram that I'm got this architectural diagram that I'm got this architectural diagram that I'm just going to paste in a real basic app",
      "segment_count": 5
    },
    {
      "frame_number": 50,
      "timestamp": 98.0,
      "timestamp_formatted": "00:01:38",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0050.png",
      "transcript": "write any of the code yet. And then I've got this architectural diagram that I'm got this architectural diagram that I'm got this architectural diagram that I'm just going to paste in a real basic app",
      "segment_count": 3
    },
    {
      "frame_number": 51,
      "timestamp": 100.0,
      "timestamp_formatted": "00:01:40",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0051.png",
      "transcript": "got this architectural diagram that I'm just going to paste in a real basic app just going to paste in a real basic app just going to paste in a real basic app right there and send it off. Now, as",
      "segment_count": 3
    },
    {
      "frame_number": 52,
      "timestamp": 102.0,
      "timestamp_formatted": "00:01:42",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0052.png",
      "transcript": "got this architectural diagram that I'm just going to paste in a real basic app just going to paste in a real basic app just going to paste in a real basic app right there and send it off. Now, as right there and send it off. Now, as right there and send it off. Now, as that's working, let's open up our code",
      "segment_count": 5
    },
    {
      "frame_number": 53,
      "timestamp": 104.0,
      "timestamp_formatted": "00:01:44",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0053.png",
      "transcript": "just going to paste in a real basic app right there and send it off. Now, as right there and send it off. Now, as right there and send it off. Now, as that's working, let's open up our code that's working, let's open up our code that's working, let's open up our code view right here. And you can see that",
      "segment_count": 5
    },
    {
      "frame_number": 54,
      "timestamp": 106.0,
      "timestamp_formatted": "00:01:46",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0054.png",
      "transcript": "right there and send it off. Now, as that's working, let's open up our code that's working, let's open up our code that's working, let's open up our code view right here. And you can see that view right here. And you can see that view right here. And you can see that it's building out all of these files,",
      "segment_count": 5
    },
    {
      "frame_number": 55,
      "timestamp": 108.0,
      "timestamp_formatted": "00:01:48",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0055.png",
      "transcript": "that's working, let's open up our code view right here. And you can see that view right here. And you can see that view right here. And you can see that it's building out all of these files, it's building out all of these files, it's building out all of these files, but with no content in them. And that's",
      "segment_count": 5
    },
    {
      "frame_number": 56,
      "timestamp": 110.0,
      "timestamp_formatted": "00:01:50",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0056.png",
      "transcript": "view right here. And you can see that it's building out all of these files, it's building out all of these files, it's building out all of these files, but with no content in them. And that's but with no content in them. And that's but with no content in them. And that's great. That's exactly what we want to",
      "segment_count": 5
    },
    {
      "frame_number": 57,
      "timestamp": 112.0,
      "timestamp_formatted": "00:01:52",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0057.png",
      "transcript": "it's building out all of these files, but with no content in them. And that's but with no content in them. And that's but with no content in them. And that's great. That's exactly what we want to great. That's exactly what we want to great. That's exactly what we want to see. Okay, great. The agent is finished.",
      "segment_count": 5
    },
    {
      "frame_number": 58,
      "timestamp": 114.0,
      "timestamp_formatted": "00:01:54",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0058.png",
      "transcript": "but with no content in them. And that's great. That's exactly what we want to great. That's exactly what we want to great. That's exactly what we want to see. Okay, great. The agent is finished. see. Okay, great. The agent is finished. see. Okay, great. The agent is finished. We get a summary of the project",
      "segment_count": 5
    },
    {
      "frame_number": 59,
      "timestamp": 116.0,
      "timestamp_formatted": "00:01:56",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0059.png",
      "transcript": "great. That's exactly what we want to see. Okay, great. The agent is finished. see. Okay, great. The agent is finished. see. Okay, great. The agent is finished. We get a summary of the project",
      "segment_count": 3
    },
    {
      "frame_number": 60,
      "timestamp": 118.0,
      "timestamp_formatted": "00:01:58",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0060.png",
      "transcript": "see. Okay, great. The agent is finished. We get a summary of the project We get a summary of the project We get a summary of the project structure, which is exactly what we",
      "segment_count": 3
    },
    {
      "frame_number": 61,
      "timestamp": 120.0,
      "timestamp_formatted": "00:02:00",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0061.png",
      "transcript": "see. Okay, great. The agent is finished. We get a summary of the project We get a summary of the project We get a summary of the project structure, which is exactly what we structure, which is exactly what we structure, which is exactly what we passed in. That's great. And we can see",
      "segment_count": 5
    },
    {
      "frame_number": 62,
      "timestamp": 122.0,
      "timestamp_formatted": "00:02:02",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0062.png",
      "transcript": "We get a summary of the project structure, which is exactly what we structure, which is exactly what we structure, which is exactly what we passed in. That's great. And we can see passed in. That's great. And we can see passed in. That's great. And we can see all of our files and folders here. And",
      "segment_count": 5
    },
    {
      "frame_number": 63,
      "timestamp": 124.0,
      "timestamp_formatted": "00:02:04",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0063.png",
      "transcript": "structure, which is exactly what we passed in. That's great. And we can see passed in. That's great. And we can see passed in. That's great. And we can see all of our files and folders here. And",
      "segment_count": 3
    },
    {
      "frame_number": 64,
      "timestamp": 126.0,
      "timestamp_formatted": "00:02:06",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0064.png",
      "transcript": "passed in. That's great. And we can see all of our files and folders here. And all of our files and folders here. And all of our files and folders here. And we can look into them and see that",
      "segment_count": 3
    },
    {
      "frame_number": 65,
      "timestamp": 128.0,
      "timestamp_formatted": "00:02:08",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0065.png",
      "transcript": "passed in. That's great. And we can see all of our files and folders here. And all of our files and folders here. And all of our files and folders here. And we can look into them and see that we can look into them and see that we can look into them and see that they're not actually populated with any",
      "segment_count": 5
    },
    {
      "frame_number": 66,
      "timestamp": 130.0,
      "timestamp_formatted": "00:02:10",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0066.png",
      "transcript": "all of our files and folders here. And we can look into them and see that we can look into them and see that we can look into them and see that they're not actually populated with any they're not actually populated with any they're not actually populated with any code yet. That's great. I'm also going",
      "segment_count": 5
    },
    {
      "frame_number": 67,
      "timestamp": 132.0,
      "timestamp_formatted": "00:02:12",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0067.png",
      "transcript": "we can look into them and see that they're not actually populated with any they're not actually populated with any they're not actually populated with any code yet. That's great. I'm also going code yet. That's great. I'm also going code yet. That's great. I'm also going to tell the model, I want you to add",
      "segment_count": 5
    },
    {
      "frame_number": 68,
      "timestamp": 134.0,
      "timestamp_formatted": "00:02:14",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0068.png",
      "transcript": "they're not actually populated with any code yet. That's great. I'm also going code yet. That's great. I'm also going code yet. That's great. I'm also going to tell the model, I want you to add",
      "segment_count": 3
    },
    {
      "frame_number": 69,
      "timestamp": 136.0,
      "timestamp_formatted": "00:02:16",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0069.png",
      "transcript": "code yet. That's great. I'm also going to tell the model, I want you to add to tell the model, I want you to add to tell the model, I want you to add these architectural decisions",
      "segment_count": 3
    },
    {
      "frame_number": 70,
      "timestamp": 138.0,
      "timestamp_formatted": "00:02:18",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0070.png",
      "transcript": "code yet. That's great. I'm also going to tell the model, I want you to add to tell the model, I want you to add to tell the model, I want you to add these architectural decisions these architectural decisions these architectural decisions in an architecture.md",
      "segment_count": 5
    },
    {
      "frame_number": 71,
      "timestamp": 140.0,
      "timestamp_formatted": "00:02:20",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0071.png",
      "transcript": "to tell the model, I want you to add these architectural decisions these architectural decisions these architectural decisions in an architecture.md",
      "segment_count": 3
    },
    {
      "frame_number": 72,
      "timestamp": 142.0,
      "timestamp_formatted": "00:02:22",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0072.png",
      "transcript": "these architectural decisions in an architecture.md in an architecture.md in an architecture.md file. And I'm doing this so that as I'm",
      "segment_count": 3
    },
    {
      "frame_number": 73,
      "timestamp": 144.0,
      "timestamp_formatted": "00:02:24",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0073.png",
      "transcript": "these architectural decisions in an architecture.md in an architecture.md in an architecture.md file. And I'm doing this so that as I'm file. And I'm doing this so that as I'm file. And I'm doing this so that as I'm working, it's always referencing the",
      "segment_count": 5
    },
    {
      "frame_number": 74,
      "timestamp": 146.0,
      "timestamp_formatted": "00:02:26",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0074.png",
      "transcript": "in an architecture.md file. And I'm doing this so that as I'm file. And I'm doing this so that as I'm file. And I'm doing this so that as I'm working, it's always referencing the working, it's always referencing the working, it's always referencing the architectural decisions that we've made.",
      "segment_count": 5
    },
    {
      "frame_number": 75,
      "timestamp": 148.0,
      "timestamp_formatted": "00:02:28",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0075.png",
      "transcript": "file. And I'm doing this so that as I'm working, it's always referencing the working, it's always referencing the working, it's always referencing the architectural decisions that we've made. architectural decisions that we've made. architectural decisions that we've made. Okay, great. The agent has created this",
      "segment_count": 5
    },
    {
      "frame_number": 76,
      "timestamp": 150.0,
      "timestamp_formatted": "00:02:30",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0076.png",
      "transcript": "working, it's always referencing the architectural decisions that we've made. architectural decisions that we've made. architectural decisions that we've made. Okay, great. The agent has created this",
      "segment_count": 3
    },
    {
      "frame_number": 77,
      "timestamp": 152.0,
      "timestamp_formatted": "00:02:32",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0077.png",
      "transcript": "architectural decisions that we've made. architectural decisions that we've made. Okay, great. The agent has created this Okay, great. The agent has created this Okay, great. The agent has created this file. And if we go into it right here,",
      "segment_count": 4
    },
    {
      "frame_number": 78,
      "timestamp": 154.0,
      "timestamp_formatted": "00:02:34",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0078.png",
      "transcript": "architectural decisions that we've made. Okay, great. The agent has created this Okay, great. The agent has created this Okay, great. The agent has created this file. And if we go into it right here, file. And if we go into it right here, file. And if we go into it right here, we can see it's going to be layered",
      "segment_count": 5
    },
    {
      "frame_number": 79,
      "timestamp": 156.0,
      "timestamp_formatted": "00:02:36",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0079.png",
      "transcript": "Okay, great. The agent has created this file. And if we go into it right here, file. And if we go into it right here, file. And if we go into it right here, we can see it's going to be layered we can see it's going to be layered we can see it's going to be layered architecture. We're using provider and",
      "segment_count": 5
    },
    {
      "frame_number": 80,
      "timestamp": 158.0,
      "timestamp_formatted": "00:02:38",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0080.png",
      "transcript": "file. And if we go into it right here, we can see it's going to be layered we can see it's going to be layered we can see it's going to be layered architecture. We're using provider and architecture. We're using provider and architecture. We're using provider and we've got some data regarding the file",
      "segment_count": 5
    },
    {
      "frame_number": 81,
      "timestamp": 160.0,
      "timestamp_formatted": "00:02:40",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0081.png",
      "transcript": "we can see it's going to be layered architecture. We're using provider and architecture. We're using provider and architecture. We're using provider and we've got some data regarding the file",
      "segment_count": 3
    },
    {
      "frame_number": 82,
      "timestamp": 162.0,
      "timestamp_formatted": "00:02:42",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0082.png",
      "transcript": "architecture. We're using provider and we've got some data regarding the file we've got some data regarding the file we've got some data regarding the file structure. Okay, that's beautiful. So, structure. Okay, that's beautiful. So, structure. Okay, that's beautiful. So, we've got this project set up and let's",
      "segment_count": 5
    },
    {
      "frame_number": 83,
      "timestamp": 164.0,
      "timestamp_formatted": "00:02:44",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0083.png",
      "transcript": "architecture. We're using provider and we've got some data regarding the file we've got some data regarding the file we've got some data regarding the file structure. Okay, that's beautiful. So, structure. Okay, that's beautiful. So, structure. Okay, that's beautiful. So, we've got this project set up and let's we've got this project set up and let's we've got this project set up and let's say we wanted to build out another",
      "segment_count": 7
    },
    {
      "frame_number": 84,
      "timestamp": 166.0,
      "timestamp_formatted": "00:02:46",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0084.png",
      "transcript": "structure. Okay, that's beautiful. So, structure. Okay, that's beautiful. So, we've got this project set up and let's we've got this project set up and let's we've got this project set up and let's say we wanted to build out another say we wanted to build out another say we wanted to build out another feature. Now, of course, I could ask the",
      "segment_count": 6
    },
    {
      "frame_number": 85,
      "timestamp": 168.0,
      "timestamp_formatted": "00:02:48",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0085.png",
      "transcript": "we've got this project set up and let's say we wanted to build out another say we wanted to build out another say we wanted to build out another feature. Now, of course, I could ask the feature. Now, of course, I could ask the feature. Now, of course, I could ask the agent to do this or I can do some of the",
      "segment_count": 5
    },
    {
      "frame_number": 86,
      "timestamp": 170.0,
      "timestamp_formatted": "00:02:50",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0086.png",
      "transcript": "say we wanted to build out another feature. Now, of course, I could ask the feature. Now, of course, I could ask the feature. Now, of course, I could ask the agent to do this or I can do some of the",
      "segment_count": 3
    },
    {
      "frame_number": 87,
      "timestamp": 172.0,
      "timestamp_formatted": "00:02:52",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0087.png",
      "transcript": "feature. Now, of course, I could ask the agent to do this or I can do some of the agent to do this or I can do some of the agent to do this or I can do some of the work myself. So, let's say I want to add",
      "segment_count": 3
    },
    {
      "frame_number": 88,
      "timestamp": 174.0,
      "timestamp_formatted": "00:02:54",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0088.png",
      "transcript": "feature. Now, of course, I could ask the agent to do this or I can do some of the agent to do this or I can do some of the agent to do this or I can do some of the work myself. So, let's say I want to add work myself. So, let's say I want to add work myself. So, let's say I want to add a feature for a new motivational quote",
      "segment_count": 5
    },
    {
      "frame_number": 89,
      "timestamp": 176.0,
      "timestamp_formatted": "00:02:56",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0089.png",
      "transcript": "agent to do this or I can do some of the work myself. So, let's say I want to add work myself. So, let's say I want to add work myself. So, let's say I want to add a feature for a new motivational quote a feature for a new motivational quote a feature for a new motivational quote each day. Well, first I would need to go",
      "segment_count": 5
    },
    {
      "frame_number": 90,
      "timestamp": 178.0,
      "timestamp_formatted": "00:02:58",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0090.png",
      "transcript": "work myself. So, let's say I want to add a feature for a new motivational quote a feature for a new motivational quote a feature for a new motivational quote each day. Well, first I would need to go",
      "segment_count": 3
    },
    {
      "frame_number": 91,
      "timestamp": 180.0,
      "timestamp_formatted": "00:03:00",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0091.png",
      "transcript": "a feature for a new motivational quote each day. Well, first I would need to go each day. Well, first I would need to go each day. Well, first I would need to go into my services to add a quote service.",
      "segment_count": 3
    },
    {
      "frame_number": 92,
      "timestamp": 182.0,
      "timestamp_formatted": "00:03:02",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0092.png",
      "transcript": "a feature for a new motivational quote each day. Well, first I would need to go each day. Well, first I would need to go each day. Well, first I would need to go into my services to add a quote service.",
      "segment_count": 3
    },
    {
      "frame_number": 93,
      "timestamp": 184.0,
      "timestamp_formatted": "00:03:04",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0093.png",
      "transcript": "each day. Well, first I would need to go into my services to add a quote service. into my services to add a quote service. into my services to add a quote service. So, I can just go into here and I can So, I can just go into here and I can So, I can just go into here and I can rightclick on service. I'm going to add",
      "segment_count": 5
    },
    {
      "frame_number": 94,
      "timestamp": 186.0,
      "timestamp_formatted": "00:03:06",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0094.png",
      "transcript": "each day. Well, first I would need to go into my services to add a quote service. into my services to add a quote service. into my services to add a quote service. So, I can just go into here and I can So, I can just go into here and I can So, I can just go into here and I can rightclick on service. I'm going to add rightclick on service. I'm going to add rightclick on service. I'm going to add a file right here and I'm going to call",
      "segment_count": 7
    },
    {
      "frame_number": 95,
      "timestamp": 188.0,
      "timestamp_formatted": "00:03:08",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0095.png",
      "transcript": "So, I can just go into here and I can So, I can just go into here and I can rightclick on service. I'm going to add rightclick on service. I'm going to add rightclick on service. I'm going to add a file right here and I'm going to call",
      "segment_count": 4
    },
    {
      "frame_number": 96,
      "timestamp": 190.0,
      "timestamp_formatted": "00:03:10",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0096.png",
      "transcript": "rightclick on service. I'm going to add a file right here and I'm going to call a file right here and I'm going to call a file right here and I'm going to call it quote service.dart. Then I'm going to",
      "segment_count": 3
    },
    {
      "frame_number": 97,
      "timestamp": 192.0,
      "timestamp_formatted": "00:03:12",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0097.png",
      "transcript": "rightclick on service. I'm going to add a file right here and I'm going to call a file right here and I'm going to call a file right here and I'm going to call it quote service.dart. Then I'm going to",
      "segment_count": 3
    },
    {
      "frame_number": 98,
      "timestamp": 194.0,
      "timestamp_formatted": "00:03:14",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0098.png",
      "transcript": "a file right here and I'm going to call it quote service.dart. Then I'm going to it quote service.dart. Then I'm going to it quote service.dart. Then I'm going to need a provider for that. So let's add a",
      "segment_count": 3
    },
    {
      "frame_number": 99,
      "timestamp": 196.0,
      "timestamp_formatted": "00:03:16",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0099.png",
      "transcript": "a file right here and I'm going to call it quote service.dart. Then I'm going to it quote service.dart. Then I'm going to it quote service.dart. Then I'm going to need a provider for that. So let's add a need a provider for that. So let's add a need a provider for that. So let's add a file here for our quote provider.",
      "segment_count": 5
    },
    {
      "frame_number": 100,
      "timestamp": 198.0,
      "timestamp_formatted": "00:03:18",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0100.png",
      "transcript": "it quote service.dart. Then I'm going to need a provider for that. So let's add a need a provider for that. So let's add a need a provider for that. So let's add a file here for our quote provider. file here for our quote provider. file here for our quote provider. And finally a widget for this. And I'll",
      "segment_count": 5
    },
    {
      "frame_number": 101,
      "timestamp": 200.0,
      "timestamp_formatted": "00:03:20",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0101.png",
      "transcript": "need a provider for that. So let's add a file here for our quote provider. file here for our quote provider. file here for our quote provider. And finally a widget for this. And I'll",
      "segment_count": 3
    },
    {
      "frame_number": 102,
      "timestamp": 202.0,
      "timestamp_formatted": "00:03:22",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0102.png",
      "transcript": "file here for our quote provider. file here for our quote provider. And finally a widget for this. And I'll And finally a widget for this. And I'll And finally a widget for this. And I'll just do the same thing. Daily quote",
      "segment_count": 4
    },
    {
      "frame_number": 103,
      "timestamp": 204.0,
      "timestamp_formatted": "00:03:24",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0103.png",
      "transcript": "file here for our quote provider. And finally a widget for this. And I'll And finally a widget for this. And I'll And finally a widget for this. And I'll just do the same thing. Daily quote just do the same thing. Daily quote just do the same thing. Daily quote card. Now obviously the next step I",
      "segment_count": 5
    },
    {
      "frame_number": 104,
      "timestamp": 206.0,
      "timestamp_formatted": "00:03:26",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0104.png",
      "transcript": "And finally a widget for this. And I'll just do the same thing. Daily quote just do the same thing. Daily quote just do the same thing. Daily quote card. Now obviously the next step I",
      "segment_count": 3
    },
    {
      "frame_number": 105,
      "timestamp": 208.0,
      "timestamp_formatted": "00:03:28",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0105.png",
      "transcript": "just do the same thing. Daily quote just do the same thing. Daily quote card. Now obviously the next step I card. Now obviously the next step I card. Now obviously the next step I would want to go into my main.dart and",
      "segment_count": 4
    },
    {
      "frame_number": 106,
      "timestamp": 210.0,
      "timestamp_formatted": "00:03:30",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0106.png",
      "transcript": "just do the same thing. Daily quote card. Now obviously the next step I card. Now obviously the next step I card. Now obviously the next step I would want to go into my main.dart and would want to go into my main.dart and would want to go into my main.dart and add this to the multi-provider. I would",
      "segment_count": 5
    },
    {
      "frame_number": 107,
      "timestamp": 212.0,
      "timestamp_formatted": "00:03:32",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0107.png",
      "transcript": "card. Now obviously the next step I would want to go into my main.dart and would want to go into my main.dart and would want to go into my main.dart and add this to the multi-provider. I would add this to the multi-provider. I would add this to the multi-provider. I would need to add that new widget on our home",
      "segment_count": 5
    },
    {
      "frame_number": 108,
      "timestamp": 214.0,
      "timestamp_formatted": "00:03:34",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0108.png",
      "transcript": "would want to go into my main.dart and add this to the multi-provider. I would add this to the multi-provider. I would add this to the multi-provider. I would need to add that new widget on our home need to add that new widget on our home need to add that new widget on our home screen. But you can see the pattern of",
      "segment_count": 5
    },
    {
      "frame_number": 109,
      "timestamp": 216.0,
      "timestamp_formatted": "00:03:36",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0109.png",
      "transcript": "add this to the multi-provider. I would need to add that new widget on our home need to add that new widget on our home need to add that new widget on our home screen. But you can see the pattern of screen. But you can see the pattern of screen. But you can see the pattern of how we would build here in a way that's",
      "segment_count": 5
    },
    {
      "frame_number": 110,
      "timestamp": 218.0,
      "timestamp_formatted": "00:03:38",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0110.png",
      "transcript": "need to add that new widget on our home screen. But you can see the pattern of screen. But you can see the pattern of screen. But you can see the pattern of how we would build here in a way that's how we would build here in a way that's how we would build here in a way that's scalable and maintainable. Not just",
      "segment_count": 5
    },
    {
      "frame_number": 111,
      "timestamp": 220.0,
      "timestamp_formatted": "00:03:40",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0111.png",
      "transcript": "screen. But you can see the pattern of how we would build here in a way that's how we would build here in a way that's how we would build here in a way that's scalable and maintainable. Not just scalable and maintainable. Not just scalable and maintainable. Not just passing off one prompt to build the",
      "segment_count": 5
    },
    {
      "frame_number": 112,
      "timestamp": 222.0,
      "timestamp_formatted": "00:03:42",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0112.png",
      "transcript": "how we would build here in a way that's scalable and maintainable. Not just scalable and maintainable. Not just scalable and maintainable. Not just passing off one prompt to build the passing off one prompt to build the passing off one prompt to build the whole app. So let's take another example",
      "segment_count": 5
    },
    {
      "frame_number": 113,
      "timestamp": 224.0,
      "timestamp_formatted": "00:03:44",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0113.png",
      "transcript": "scalable and maintainable. Not just passing off one prompt to build the passing off one prompt to build the passing off one prompt to build the whole app. So let's take another example whole app. So let's take another example whole app. So let's take another example and this time let's do a slightly more",
      "segment_count": 5
    },
    {
      "frame_number": 114,
      "timestamp": 226.0,
      "timestamp_formatted": "00:03:46",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0114.png",
      "transcript": "passing off one prompt to build the whole app. So let's take another example whole app. So let's take another example whole app. So let's take another example and this time let's do a slightly more and this time let's do a slightly more and this time let's do a slightly more complex architecture and slightly more",
      "segment_count": 5
    },
    {
      "frame_number": 115,
      "timestamp": 228.0,
      "timestamp_formatted": "00:03:48",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0115.png",
      "transcript": "whole app. So let's take another example and this time let's do a slightly more and this time let's do a slightly more and this time let's do a slightly more complex architecture and slightly more complex architecture and slightly more complex architecture and slightly more opinionated decisions here. So we're",
      "segment_count": 5
    },
    {
      "frame_number": 116,
      "timestamp": 230.0,
      "timestamp_formatted": "00:03:50",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0116.png",
      "transcript": "and this time let's do a slightly more complex architecture and slightly more complex architecture and slightly more complex architecture and slightly more opinionated decisions here. So we're opinionated decisions here. So we're opinionated decisions here. So we're going to do another habit tracker and",
      "segment_count": 5
    },
    {
      "frame_number": 117,
      "timestamp": 232.0,
      "timestamp_formatted": "00:03:52",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0117.png",
      "transcript": "complex architecture and slightly more opinionated decisions here. So we're opinionated decisions here. So we're opinionated decisions here. So we're going to do another habit tracker and",
      "segment_count": 3
    },
    {
      "frame_number": 118,
      "timestamp": 234.0,
      "timestamp_formatted": "00:03:54",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0118.png",
      "transcript": "opinionated decisions here. So we're going to do another habit tracker and going to do another habit tracker and going to do another habit tracker and it's going to be habit complex. Let's",
      "segment_count": 3
    },
    {
      "frame_number": 119,
      "timestamp": 236.0,
      "timestamp_formatted": "00:03:56",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0119.png",
      "transcript": "opinionated decisions here. So we're going to do another habit tracker and going to do another habit tracker and going to do another habit tracker and it's going to be habit complex. Let's it's going to be habit complex. Let's it's going to be habit complex. Let's create that project.",
      "segment_count": 5
    },
    {
      "frame_number": 120,
      "timestamp": 238.0,
      "timestamp_formatted": "00:03:58",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0120.png",
      "transcript": "going to do another habit tracker and it's going to be habit complex. Let's it's going to be habit complex. Let's it's going to be habit complex. Let's create that project. create that project. create that project. Okay. So for this app I'm going to say I",
      "segment_count": 5
    },
    {
      "frame_number": 121,
      "timestamp": 240.0,
      "timestamp_formatted": "00:04:00",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0121.png",
      "transcript": "it's going to be habit complex. Let's create that project. create that project. create that project. Okay. So for this app I'm going to say I",
      "segment_count": 3
    },
    {
      "frame_number": 122,
      "timestamp": 242.0,
      "timestamp_formatted": "00:04:02",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0122.png",
      "transcript": "create that project. Okay. So for this app I'm going to say I Okay. So for this app I'm going to say I Okay. So for this app I'm going to say I want to build a habit tracker using",
      "segment_count": 3
    },
    {
      "frame_number": 123,
      "timestamp": 244.0,
      "timestamp_formatted": "00:04:04",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0123.png",
      "transcript": "create that project. Okay. So for this app I'm going to say I Okay. So for this app I'm going to say I Okay. So for this app I'm going to say I want to build a habit tracker using",
      "segment_count": 3
    },
    {
      "frame_number": 124,
      "timestamp": 246.0,
      "timestamp_formatted": "00:04:06",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0124.png",
      "transcript": "Okay. So for this app I'm going to say I want to build a habit tracker using want to build a habit tracker using want to build a habit tracker using featurebased architecture. I'm going to",
      "segment_count": 3
    },
    {
      "frame_number": 125,
      "timestamp": 248.0,
      "timestamp_formatted": "00:04:08",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0125.png",
      "transcript": "Okay. So for this app I'm going to say I want to build a habit tracker using want to build a habit tracker using want to build a habit tracker using featurebased architecture. I'm going to",
      "segment_count": 3
    },
    {
      "frame_number": 126,
      "timestamp": 250.0,
      "timestamp_formatted": "00:04:10",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0126.png",
      "transcript": "want to build a habit tracker using featurebased architecture. I'm going to featurebased architecture. I'm going to featurebased architecture. I'm going to use riverpod for state management. Go",
      "segment_count": 3
    },
    {
      "frame_number": 127,
      "timestamp": 252.0,
      "timestamp_formatted": "00:04:12",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0127.png",
      "transcript": "want to build a habit tracker using featurebased architecture. I'm going to featurebased architecture. I'm going to featurebased architecture. I'm going to use riverpod for state management. Go use riverpod for state management. Go use riverpod for state management. Go router for routing. Do for networking.",
      "segment_count": 5
    },
    {
      "frame_number": 128,
      "timestamp": 254.0,
      "timestamp_formatted": "00:04:14",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0128.png",
      "transcript": "featurebased architecture. I'm going to use riverpod for state management. Go use riverpod for state management. Go use riverpod for state management. Go router for routing. Do for networking.",
      "segment_count": 3
    },
    {
      "frame_number": 129,
      "timestamp": 256.0,
      "timestamp_formatted": "00:04:16",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0129.png",
      "transcript": "use riverpod for state management. Go use riverpod for state management. Go router for routing. Do for networking. router for routing. Do for networking. router for routing. Do for networking. Freeze and JSON annotation for data",
      "segment_count": 4
    },
    {
      "frame_number": 130,
      "timestamp": 258.0,
      "timestamp_formatted": "00:04:18",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0130.png",
      "transcript": "use riverpod for state management. Go router for routing. Do for networking. router for routing. Do for networking. router for routing. Do for networking. Freeze and JSON annotation for data",
      "segment_count": 3
    },
    {
      "frame_number": 131,
      "timestamp": 260.0,
      "timestamp_formatted": "00:04:20",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0131.png",
      "transcript": "router for routing. Do for networking. Freeze and JSON annotation for data Freeze and JSON annotation for data Freeze and JSON annotation for data modeling and serialization. shared",
      "segment_count": 3
    },
    {
      "frame_number": 132,
      "timestamp": 262.0,
      "timestamp_formatted": "00:04:22",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0132.png",
      "transcript": "router for routing. Do for networking. Freeze and JSON annotation for data Freeze and JSON annotation for data Freeze and JSON annotation for data modeling and serialization. shared",
      "segment_count": 3
    },
    {
      "frame_number": 133,
      "timestamp": 264.0,
      "timestamp_formatted": "00:04:24",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0133.png",
      "transcript": "Freeze and JSON annotation for data modeling and serialization. shared modeling and serialization. shared modeling and serialization. shared preferences for simple storage and Intel",
      "segment_count": 3
    },
    {
      "frame_number": 134,
      "timestamp": 266.0,
      "timestamp_formatted": "00:04:26",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0134.png",
      "transcript": "Freeze and JSON annotation for data modeling and serialization. shared modeling and serialization. shared modeling and serialization. shared preferences for simple storage and Intel preferences for simple storage and Intel preferences for simple storage and Intel for internationalization and",
      "segment_count": 5
    },
    {
      "frame_number": 135,
      "timestamp": 268.0,
      "timestamp_formatted": "00:04:28",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0135.png",
      "transcript": "modeling and serialization. shared preferences for simple storage and Intel preferences for simple storage and Intel preferences for simple storage and Intel for internationalization and for internationalization and for internationalization and localization. Now, same thing as before,",
      "segment_count": 5
    },
    {
      "frame_number": 136,
      "timestamp": 270.0,
      "timestamp_formatted": "00:04:30",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0136.png",
      "transcript": "preferences for simple storage and Intel for internationalization and for internationalization and for internationalization and localization. Now, same thing as before, localization. Now, same thing as before, localization. Now, same thing as before, I don't want you to write any of the",
      "segment_count": 5
    },
    {
      "frame_number": 137,
      "timestamp": 272.0,
      "timestamp_formatted": "00:04:32",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0137.png",
      "transcript": "for internationalization and localization. Now, same thing as before, localization. Now, same thing as before, localization. Now, same thing as before, I don't want you to write any of the",
      "segment_count": 3
    },
    {
      "frame_number": 138,
      "timestamp": 274.0,
      "timestamp_formatted": "00:04:34",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0138.png",
      "transcript": "localization. Now, same thing as before, I don't want you to write any of the I don't want you to write any of the I don't want you to write any of the code, just create the files and folders",
      "segment_count": 3
    },
    {
      "frame_number": 139,
      "timestamp": 276.0,
      "timestamp_formatted": "00:04:36",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0139.png",
      "transcript": "localization. Now, same thing as before, I don't want you to write any of the I don't want you to write any of the I don't want you to write any of the code, just create the files and folders",
      "segment_count": 3
    },
    {
      "frame_number": 140,
      "timestamp": 278.0,
      "timestamp_formatted": "00:04:38",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0140.png",
      "transcript": "I don't want you to write any of the code, just create the files and folders code, just create the files and folders code, just create the files and folders and add dependencies to the pubspec.",
      "segment_count": 3
    },
    {
      "frame_number": 141,
      "timestamp": 280.0,
      "timestamp_formatted": "00:04:40",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0141.png",
      "transcript": "I don't want you to write any of the code, just create the files and folders code, just create the files and folders code, just create the files and folders and add dependencies to the pubspec.",
      "segment_count": 3
    },
    {
      "frame_number": 142,
      "timestamp": 282.0,
      "timestamp_formatted": "00:04:42",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0142.png",
      "transcript": "code, just create the files and folders and add dependencies to the pubspec. and add dependencies to the pubspec. and add dependencies to the pubspec. Okay, great. Now, let's just add the",
      "segment_count": 3
    },
    {
      "frame_number": 143,
      "timestamp": 284.0,
      "timestamp_formatted": "00:04:44",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0143.png",
      "transcript": "code, just create the files and folders and add dependencies to the pubspec. and add dependencies to the pubspec. and add dependencies to the pubspec. Okay, great. Now, let's just add the Okay, great. Now, let's just add the Okay, great. Now, let's just add the architectural diagram and send it off.",
      "segment_count": 5
    },
    {
      "frame_number": 144,
      "timestamp": 286.0,
      "timestamp_formatted": "00:04:46",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0144.png",
      "transcript": "and add dependencies to the pubspec. Okay, great. Now, let's just add the Okay, great. Now, let's just add the Okay, great. Now, let's just add the architectural diagram and send it off.",
      "segment_count": 3
    },
    {
      "frame_number": 145,
      "timestamp": 288.0,
      "timestamp_formatted": "00:04:48",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0145.png",
      "transcript": "Okay, great. Now, let's just add the architectural diagram and send it off. architectural diagram and send it off. architectural diagram and send it off. There we go. Adding all the",
      "segment_count": 3
    },
    {
      "frame_number": 146,
      "timestamp": 290.0,
      "timestamp_formatted": "00:04:50",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0146.png",
      "transcript": "Okay, great. Now, let's just add the architectural diagram and send it off. architectural diagram and send it off. architectural diagram and send it off. There we go. Adding all the There we go. Adding all the There we go. Adding all the dependencies. That looks great. Checking",
      "segment_count": 5
    },
    {
      "frame_number": 147,
      "timestamp": 292.0,
      "timestamp_formatted": "00:04:52",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0147.png",
      "transcript": "architectural diagram and send it off. There we go. Adding all the There we go. Adding all the There we go. Adding all the dependencies. That looks great. Checking dependencies. That looks great. Checking dependencies. That looks great. Checking the pubspec. Okay, that's great. Let's",
      "segment_count": 5
    },
    {
      "frame_number": 148,
      "timestamp": 294.0,
      "timestamp_formatted": "00:04:54",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0148.png",
      "transcript": "There we go. Adding all the dependencies. That looks great. Checking dependencies. That looks great. Checking dependencies. That looks great. Checking the pubspec. Okay, that's great. Let's the pubspec. Okay, that's great. Let's the pubspec. Okay, that's great. Let's check out the file structure. We've got",
      "segment_count": 5
    },
    {
      "frame_number": 149,
      "timestamp": 296.0,
      "timestamp_formatted": "00:04:56",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0149.png",
      "transcript": "dependencies. That looks great. Checking the pubspec. Okay, that's great. Let's the pubspec. Okay, that's great. Let's the pubspec. Okay, that's great. Let's check out the file structure. We've got check out the file structure. We've got check out the file structure. We've got our features, just one feature for now.",
      "segment_count": 5
    },
    {
      "frame_number": 150,
      "timestamp": 298.0,
      "timestamp_formatted": "00:04:58",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0150.png",
      "transcript": "the pubspec. Okay, that's great. Let's check out the file structure. We've got check out the file structure. We've got check out the file structure. We've got our features, just one feature for now. our features, just one feature for now. our features, just one feature for now. Our posts with our three layers right",
      "segment_count": 5
    },
    {
      "frame_number": 151,
      "timestamp": 300.0,
      "timestamp_formatted": "00:05:00",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0151.png",
      "transcript": "check out the file structure. We've got our features, just one feature for now. our features, just one feature for now. our features, just one feature for now. Our posts with our three layers right Our posts with our three layers right Our posts with our three layers right here. That looks beautiful. Now, if I",
      "segment_count": 5
    },
    {
      "frame_number": 152,
      "timestamp": 302.0,
      "timestamp_formatted": "00:05:02",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0152.png",
      "transcript": "our features, just one feature for now. Our posts with our three layers right Our posts with our three layers right Our posts with our three layers right here. That looks beautiful. Now, if I here. That looks beautiful. Now, if I here. That looks beautiful. Now, if I were to continue working on this",
      "segment_count": 5
    },
    {
      "frame_number": 153,
      "timestamp": 304.0,
      "timestamp_formatted": "00:05:04",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0153.png",
      "transcript": "Our posts with our three layers right here. That looks beautiful. Now, if I here. That looks beautiful. Now, if I here. That looks beautiful. Now, if I were to continue working on this were to continue working on this were to continue working on this project, I would probably delegate the",
      "segment_count": 5
    },
    {
      "frame_number": 154,
      "timestamp": 306.0,
      "timestamp_formatted": "00:05:06",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0154.png",
      "transcript": "here. That looks beautiful. Now, if I were to continue working on this were to continue working on this were to continue working on this project, I would probably delegate the project, I would probably delegate the project, I would probably delegate the agent to configuring the basic routing,",
      "segment_count": 5
    },
    {
      "frame_number": 155,
      "timestamp": 308.0,
      "timestamp_formatted": "00:05:08",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0155.png",
      "transcript": "were to continue working on this project, I would probably delegate the project, I would probably delegate the project, I would probably delegate the agent to configuring the basic routing, agent to configuring the basic routing, agent to configuring the basic routing, setting up provider scope, then maybe I",
      "segment_count": 5
    },
    {
      "frame_number": 156,
      "timestamp": 310.0,
      "timestamp_formatted": "00:05:10",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0156.png",
      "transcript": "project, I would probably delegate the agent to configuring the basic routing, agent to configuring the basic routing, agent to configuring the basic routing, setting up provider scope, then maybe I",
      "segment_count": 3
    },
    {
      "frame_number": 157,
      "timestamp": 312.0,
      "timestamp_formatted": "00:05:12",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0157.png",
      "transcript": "agent to configuring the basic routing, agent to configuring the basic routing, setting up provider scope, then maybe I setting up provider scope, then maybe I setting up provider scope, then maybe I would focus on the domain layer of our would focus on the domain layer of our would focus on the domain layer of our first feature habits. And once again,",
      "segment_count": 6
    },
    {
      "frame_number": 158,
      "timestamp": 314.0,
      "timestamp_formatted": "00:05:14",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0158.png",
      "transcript": "agent to configuring the basic routing, setting up provider scope, then maybe I setting up provider scope, then maybe I setting up provider scope, then maybe I would focus on the domain layer of our would focus on the domain layer of our would focus on the domain layer of our first feature habits. And once again,",
      "segment_count": 5
    },
    {
      "frame_number": 159,
      "timestamp": 316.0,
      "timestamp_formatted": "00:05:16",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0159.png",
      "transcript": "would focus on the domain layer of our would focus on the domain layer of our first feature habits. And once again, first feature habits. And once again, first feature habits. And once again, the idea is working in small, iterative,",
      "segment_count": 4
    },
    {
      "frame_number": 160,
      "timestamp": 318.0,
      "timestamp_formatted": "00:05:18",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0160.png",
      "transcript": "would focus on the domain layer of our first feature habits. And once again, first feature habits. And once again, first feature habits. And once again, the idea is working in small, iterative, the idea is working in small, iterative, the idea is working in small, iterative, and testable steps. So the big idea is",
      "segment_count": 5
    },
    {
      "frame_number": 161,
      "timestamp": 320.0,
      "timestamp_formatted": "00:05:20",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0161.png",
      "transcript": "first feature habits. And once again, the idea is working in small, iterative, the idea is working in small, iterative, the idea is working in small, iterative, and testable steps. So the big idea is and testable steps. So the big idea is and testable steps. So the big idea is that by prompting Dreamflow with",
      "segment_count": 5
    },
    {
      "frame_number": 162,
      "timestamp": 322.0,
      "timestamp_formatted": "00:05:22",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0162.png",
      "transcript": "the idea is working in small, iterative, and testable steps. So the big idea is and testable steps. So the big idea is and testable steps. So the big idea is that by prompting Dreamflow with",
      "segment_count": 3
    },
    {
      "frame_number": 163,
      "timestamp": 324.0,
      "timestamp_formatted": "00:05:24",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0163.png",
      "transcript": "and testable steps. So the big idea is and testable steps. So the big idea is that by prompting Dreamflow with that by prompting Dreamflow with that by prompting Dreamflow with specific architectural patterns and",
      "segment_count": 4
    },
    {
      "frame_number": 164,
      "timestamp": 326.0,
      "timestamp_formatted": "00:05:26",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0164.png",
      "transcript": "and testable steps. So the big idea is that by prompting Dreamflow with that by prompting Dreamflow with that by prompting Dreamflow with specific architectural patterns and specific architectural patterns and specific architectural patterns and libraries, we've laid the groundwork for",
      "segment_count": 5
    },
    {
      "frame_number": 165,
      "timestamp": 328.0,
      "timestamp_formatted": "00:05:28",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0165.png",
      "transcript": "that by prompting Dreamflow with specific architectural patterns and specific architectural patterns and specific architectural patterns and libraries, we've laid the groundwork for libraries, we've laid the groundwork for libraries, we've laid the groundwork for maintainable production applications,",
      "segment_count": 5
    },
    {
      "frame_number": 166,
      "timestamp": 330.0,
      "timestamp_formatted": "00:05:30",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0166.png",
      "transcript": "specific architectural patterns and libraries, we've laid the groundwork for libraries, we've laid the groundwork for libraries, we've laid the groundwork for maintainable production applications,",
      "segment_count": 3
    },
    {
      "frame_number": 167,
      "timestamp": 332.0,
      "timestamp_formatted": "00:05:32",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0167.png",
      "transcript": "libraries, we've laid the groundwork for maintainable production applications, maintainable production applications, maintainable production applications, not just throwaway prototypes. This",
      "segment_count": 3
    },
    {
      "frame_number": 168,
      "timestamp": 334.0,
      "timestamp_formatted": "00:05:34",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0168.png",
      "transcript": "libraries, we've laid the groundwork for maintainable production applications, maintainable production applications, maintainable production applications, not just throwaway prototypes. This not just throwaway prototypes. This not just throwaway prototypes. This isn't vibe coding and it isn't magic.",
      "segment_count": 5
    },
    {
      "frame_number": 169,
      "timestamp": 336.0,
      "timestamp_formatted": "00:05:36",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0169.png",
      "transcript": "maintainable production applications, not just throwaway prototypes. This not just throwaway prototypes. This not just throwaway prototypes. This isn't vibe coding and it isn't magic. isn't vibe coding and it isn't magic. isn't vibe coding and it isn't magic. These are powerful force multipliers,",
      "segment_count": 5
    },
    {
      "frame_number": 170,
      "timestamp": 338.0,
      "timestamp_formatted": "00:05:38",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0170.png",
      "transcript": "not just throwaway prototypes. This isn't vibe coding and it isn't magic. isn't vibe coding and it isn't magic. isn't vibe coding and it isn't magic. These are powerful force multipliers,",
      "segment_count": 3
    },
    {
      "frame_number": 171,
      "timestamp": 340.0,
      "timestamp_formatted": "00:05:40",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0171.png",
      "transcript": "isn't vibe coding and it isn't magic. These are powerful force multipliers, These are powerful force multipliers, These are powerful force multipliers, but their output is a direct reflection",
      "segment_count": 3
    },
    {
      "frame_number": 172,
      "timestamp": 342.0,
      "timestamp_formatted": "00:05:42",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0172.png",
      "transcript": "isn't vibe coding and it isn't magic. These are powerful force multipliers, These are powerful force multipliers, These are powerful force multipliers, but their output is a direct reflection but their output is a direct reflection but their output is a direct reflection of your input. A vague prompt gets you a",
      "segment_count": 5
    },
    {
      "frame_number": 173,
      "timestamp": 344.0,
      "timestamp_formatted": "00:05:44",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0173.png",
      "transcript": "These are powerful force multipliers, but their output is a direct reflection but their output is a direct reflection but their output is a direct reflection of your input. A vague prompt gets you a",
      "segment_count": 3
    },
    {
      "frame_number": 174,
      "timestamp": 346.0,
      "timestamp_formatted": "00:05:46",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0174.png",
      "transcript": "but their output is a direct reflection of your input. A vague prompt gets you a of your input. A vague prompt gets you a of your input. A vague prompt gets you a vague result. A professional,",
      "segment_count": 3
    },
    {
      "frame_number": 175,
      "timestamp": 348.0,
      "timestamp_formatted": "00:05:48",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0175.png",
      "transcript": "but their output is a direct reflection of your input. A vague prompt gets you a of your input. A vague prompt gets you a of your input. A vague prompt gets you a vague result. A professional, vague result. A professional, vague result. A professional, architecturally aware prompt gets you a",
      "segment_count": 5
    },
    {
      "frame_number": 176,
      "timestamp": 350.0,
      "timestamp_formatted": "00:05:50",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0176.png",
      "transcript": "of your input. A vague prompt gets you a vague result. A professional, vague result. A professional, vague result. A professional, architecturally aware prompt gets you a architecturally aware prompt gets you a architecturally aware prompt gets you a professional codebase. And this",
      "segment_count": 5
    },
    {
      "frame_number": 177,
      "timestamp": 352.0,
      "timestamp_formatted": "00:05:52",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0177.png",
      "transcript": "vague result. A professional, architecturally aware prompt gets you a architecturally aware prompt gets you a architecturally aware prompt gets you a professional codebase. And this professional codebase. And this professional codebase. And this fundamentally elevates your role. You",
      "segment_count": 5
    },
    {
      "frame_number": 178,
      "timestamp": 354.0,
      "timestamp_formatted": "00:05:54",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0178.png",
      "transcript": "architecturally aware prompt gets you a professional codebase. And this professional codebase. And this professional codebase. And this fundamentally elevates your role. You",
      "segment_count": 3
    },
    {
      "frame_number": 179,
      "timestamp": 356.0,
      "timestamp_formatted": "00:05:56",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0179.png",
      "transcript": "professional codebase. And this fundamentally elevates your role. You fundamentally elevates your role. You fundamentally elevates your role. You spend less time on the tedious setup and",
      "segment_count": 3
    },
    {
      "frame_number": 180,
      "timestamp": 358.0,
      "timestamp_formatted": "00:05:58",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0180.png",
      "transcript": "professional codebase. And this fundamentally elevates your role. You fundamentally elevates your role. You fundamentally elevates your role. You spend less time on the tedious setup and spend less time on the tedious setup and spend less time on the tedious setup and more time on what really matters, the",
      "segment_count": 5
    },
    {
      "frame_number": 181,
      "timestamp": 360.0,
      "timestamp_formatted": "00:06:00",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0181.png",
      "transcript": "fundamentally elevates your role. You spend less time on the tedious setup and spend less time on the tedious setup and spend less time on the tedious setup and more time on what really matters, the more time on what really matters, the more time on what really matters, the high-level design and the core logic of",
      "segment_count": 5
    },
    {
      "frame_number": 182,
      "timestamp": 362.0,
      "timestamp_formatted": "00:06:02",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0182.png",
      "transcript": "spend less time on the tedious setup and more time on what really matters, the more time on what really matters, the more time on what really matters, the high-level design and the core logic of high-level design and the core logic of high-level design and the core logic of your app. It shifts the essential skill",
      "segment_count": 5
    },
    {
      "frame_number": 183,
      "timestamp": 364.0,
      "timestamp_formatted": "00:06:04",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0183.png",
      "transcript": "more time on what really matters, the high-level design and the core logic of high-level design and the core logic of high-level design and the core logic of your app. It shifts the essential skill your app. It shifts the essential skill your app. It shifts the essential skill from just knowing how to code to knowing",
      "segment_count": 5
    },
    {
      "frame_number": 184,
      "timestamp": 366.0,
      "timestamp_formatted": "00:06:06",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0184.png",
      "transcript": "high-level design and the core logic of your app. It shifts the essential skill your app. It shifts the essential skill your app. It shifts the essential skill from just knowing how to code to knowing",
      "segment_count": 3
    },
    {
      "frame_number": 185,
      "timestamp": 368.0,
      "timestamp_formatted": "00:06:08",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0185.png",
      "transcript": "your app. It shifts the essential skill from just knowing how to code to knowing from just knowing how to code to knowing from just knowing how to code to knowing how to communicate a complex system. So",
      "segment_count": 3
    },
    {
      "frame_number": 186,
      "timestamp": 370.0,
      "timestamp_formatted": "00:06:10",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0186.png",
      "transcript": "your app. It shifts the essential skill from just knowing how to code to knowing from just knowing how to code to knowing from just knowing how to code to knowing how to communicate a complex system. So",
      "segment_count": 3
    },
    {
      "frame_number": 187,
      "timestamp": 372.0,
      "timestamp_formatted": "00:06:12",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0187.png",
      "transcript": "from just knowing how to code to knowing how to communicate a complex system. So how to communicate a complex system. So how to communicate a complex system. So remember this process. Think like an",
      "segment_count": 3
    },
    {
      "frame_number": 188,
      "timestamp": 374.0,
      "timestamp_formatted": "00:06:14",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0188.png",
      "transcript": "from just knowing how to code to knowing how to communicate a complex system. So how to communicate a complex system. So how to communicate a complex system. So remember this process. Think like an remember this process. Think like an remember this process. Think like an architect. prompt in clear iterative",
      "segment_count": 5
    },
    {
      "frame_number": 189,
      "timestamp": 376.0,
      "timestamp_formatted": "00:06:16",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0189.png",
      "transcript": "how to communicate a complex system. So remember this process. Think like an remember this process. Think like an remember this process. Think like an architect. prompt in clear iterative architect. prompt in clear iterative architect. prompt in clear iterative steps and review the output constantly.",
      "segment_count": 5
    },
    {
      "frame_number": 190,
      "timestamp": 378.0,
      "timestamp_formatted": "00:06:18",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0190.png",
      "transcript": "remember this process. Think like an architect. prompt in clear iterative architect. prompt in clear iterative architect. prompt in clear iterative steps and review the output constantly.",
      "segment_count": 3
    },
    {
      "frame_number": 191,
      "timestamp": 380.0,
      "timestamp_formatted": "00:06:20",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0191.png",
      "transcript": "architect. prompt in clear iterative steps and review the output constantly. steps and review the output constantly. steps and review the output constantly. Treat the AI agent not like a magician,",
      "segment_count": 3
    },
    {
      "frame_number": 192,
      "timestamp": 382.0,
      "timestamp_formatted": "00:06:22",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0192.png",
      "transcript": "architect. prompt in clear iterative steps and review the output constantly. steps and review the output constantly. steps and review the output constantly. Treat the AI agent not like a magician, Treat the AI agent not like a magician, Treat the AI agent not like a magician, but like a junior developer who's fast",
      "segment_count": 5
    },
    {
      "frame_number": 193,
      "timestamp": 384.0,
      "timestamp_formatted": "00:06:24",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0193.png",
      "transcript": "steps and review the output constantly. Treat the AI agent not like a magician, Treat the AI agent not like a magician, Treat the AI agent not like a magician, but like a junior developer who's fast but like a junior developer who's fast but like a junior developer who's fast and smart, but needs your direction and",
      "segment_count": 5
    },
    {
      "frame_number": 194,
      "timestamp": 386.0,
      "timestamp_formatted": "00:06:26",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0194.png",
      "transcript": "Treat the AI agent not like a magician, but like a junior developer who's fast but like a junior developer who's fast but like a junior developer who's fast and smart, but needs your direction and",
      "segment_count": 3
    },
    {
      "frame_number": 195,
      "timestamp": 388.0,
      "timestamp_formatted": "00:06:28",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0195.png",
      "transcript": "but like a junior developer who's fast and smart, but needs your direction and and smart, but needs your direction and and smart, but needs your direction and review. You are the lead architect.",
      "segment_count": 3
    },
    {
      "frame_number": 196,
      "timestamp": 390.0,
      "timestamp_formatted": "00:06:30",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0196.png",
      "transcript": "but like a junior developer who's fast and smart, but needs your direction and and smart, but needs your direction and and smart, but needs your direction and review. You are the lead architect. review. You are the lead architect. review. You are the lead architect. Mastering this conversation is a new",
      "segment_count": 5
    },
    {
      "frame_number": 197,
      "timestamp": 392.0,
      "timestamp_formatted": "00:06:32",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0197.png",
      "transcript": "and smart, but needs your direction and review. You are the lead architect. review. You are the lead architect. review. You are the lead architect. Mastering this conversation is a new Mastering this conversation is a new Mastering this conversation is a new essential skill for developers, and it",
      "segment_count": 5
    },
    {
      "frame_number": 198,
      "timestamp": 394.0,
      "timestamp_formatted": "00:06:34",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0198.png",
      "transcript": "review. You are the lead architect. Mastering this conversation is a new Mastering this conversation is a new Mastering this conversation is a new essential skill for developers, and it essential skill for developers, and it essential skill for developers, and it will save you countless hours of",
      "segment_count": 5
    },
    {
      "frame_number": 199,
      "timestamp": 396.0,
      "timestamp_formatted": "00:06:36",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0199.png",
      "transcript": "Mastering this conversation is a new essential skill for developers, and it essential skill for developers, and it essential skill for developers, and it will save you countless hours of will save you countless hours of will save you countless hours of refactoring down the line. Thanks for",
      "segment_count": 5
    },
    {
      "frame_number": 200,
      "timestamp": 398.0,
      "timestamp_formatted": "00:06:38",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0200.png",
      "transcript": "essential skill for developers, and it will save you countless hours of will save you countless hours of will save you countless hours of refactoring down the line. Thanks for refactoring down the line. Thanks for refactoring down the line. Thanks for watching the video, and we'll see you in",
      "segment_count": 5
    },
    {
      "frame_number": 201,
      "timestamp": 400.0,
      "timestamp_formatted": "00:06:40",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0201.png",
      "transcript": "will save you countless hours of refactoring down the line. Thanks for refactoring down the line. Thanks for refactoring down the line. Thanks for watching the video, and we'll see you in watching the video, and we'll see you in watching the video, and we'll see you in the next one.",
      "segment_count": 5
    },
    {
      "frame_number": 202,
      "timestamp": 402.0,
      "timestamp_formatted": "00:06:42",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0202.png",
      "transcript": "refactoring down the line. Thanks for watching the video, and we'll see you in watching the video, and we'll see you in watching the video, and we'll see you in the next one. the next one.",
      "segment_count": 4
    },
    {
      "frame_number": 203,
      "timestamp": 404.0,
      "timestamp_formatted": "00:06:44",
      "frame_path": "/Users/kcdacre8tor/veidotools/frames/1766649374-Stop_Vibe_Coding._Start_Architecting._keyframes/frame_0203.png",
      "transcript": "watching the video, and we'll see you in the next one. the next one. the next one. [Music]",
      "segment_count": 3
    }
  ]
}